tests/loadtests/auth-test.yml
config:
  target: "http://localhost:4000"
  processor: "./common-script.js"
  phases:
    - duration: 3
      arrivalRate: 20
    - duration: 5
      arrivalRate: 50
    - duration: 5
      arrivalRate: 100
    - duration: 5
      arrivalRate: 200
    - duration: 3
      arrivalRate: 50

scenarios:
  - name: "Authentication Load Test"
    flow:
      - function: createUserData
      - post:
          url: "/api/auth/register"
          json:
            name: "{{ name }}"
            email: "{{ email }}"
            password: "{{ password }}"
            role: "{{ role }}"
            company: "{{ company }}"
            phone: "{{ phone }}"
          afterResponse: "saveToken"
      - think: 1
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          afterResponse: "saveToken"
      - get:
          url: "/api/auth/me"
          headers:
            Authorization: "Bearer {{ token }}"